In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import missingno as msno
import warnings
warnings.filterwarnings('ignore')

import scipy as sp
from scipy import stats

In [6]:
%pwd
%cd /Users/kengohirano/Desktop/Dacon/Dacon_competiton/2024.03.12/Data/

/Users/kengohirano/Desktop/Dacon/Dacon_competiton/2024.03.12/Data

In [9]:
# 데이터 불러오기

orig = pd.read_csv('train.csv')
df = pd.read_csv('train.csv')
test_df = pd.read_csv('test.csv')

In [11]:
# 정규성 확인

def availiability(data):
    
    dtypes = data.dtypes
    nunique = data.nunique()
    is_na = data.isna().sum()

    table = pd.concat([dtypes , nunique , is_na] , axis = 1)
    table.columns = ['dtype' , 'nunique' , 'NA']

    return table.reset_index()

In [12]:
availiability(df).to_csv('aval_train.csv')
availiability(test_df).to_csv('aval_test.csv')

In [14]:
print(f"Train : {df.shape}")
print(f"Test : {test_df.shape}")

Train : (20000, 23)
Test : (10000, 22)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 23 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   ID                      20000 non-null  object
 1   Age                     20000 non-null  int64
 2   Gender                  20000 non-null  object
 3   Education_Status        20000 non-null  object
 4   Employment_Status       20000 non-null  object
 5   Working_Week (Yearly)   20000 non-null  int64
 6   Industry_Status         20000 non-null  object
 7   Occupation_Status       20000 non-null  object
 8   Race                    20000 non-null  object
 9   Hispanic_Origin         20000 non-null  object
 10  Martial_Status          20000 non-null  object
 11  Household_Status        20000 non-null  object
 12  Household_Summary       20000 non-null  object
 13  Citizenship             20000 non-null  object
 14  Birth_Country           20000 non-null  object
 15  Birth_Country (Father)  20000 non-null  object
 16  Birth_Country (Mother)  20000 non-null  object
 17  Tax_Status              20000 non-null  object
 18  Gains                   20000 non-null  int64
 19  Losses                  20000 non-null  int64
 20  Dividends               20000 non-null  int64
 21  Income_Status           20000 non-null  object
 22  Income                  20000 non-null  int64
dtypes: int64(6), object(17)
memory usage: 3.5+ MB

In [20]:
df.iloc[:3 , :10]

,ID,Age,Gender,Education_Status,Employment_Status,Working_Week (Yearly),Industry_Status,Occupation_Status,Race,Hispanic_Origin
0,TRAIN_00000,63,M,Middle (7-8),Full-Time,4,Social Services,Services,White,All other
1,TRAIN_00001,37,M,Associates degree (Vocational),Full-Time,52,Entertainment,Services,White,All other
2,TRAIN_00002,58,F,High graduate,Full-Time,52,Manufacturing (Non-durable),Admin Support (include Clerical),Black,All other

In [23]:
df.iloc[:3 , 10:20]

,Martial_Status,Household_Status,Household_Summary,Citizenship,Birth_Country,Birth_Country (Father),Birth_Country (Mother),Tax_Status,Gains,Losses
0,Married,Householder,Householder,Native,US,US,US,Nonfiler,0,0
1,Separated,Nonfamily householder,Householder,Native,US,US,US,Single,0,0
2,Married,Householder,Householder,Native,US,US,US,Married Filling Jointly both under 65 (MFJ),3411,0

In [24]:
df.iloc[:3 , 20:24]

   Dividends Income_Status  Income
0          0       Unknown     425
1          0  Under Median       0
2          0  Under Median     860